{
  "backend/main.mo": "Main Motoko actor defining data types (Producer, Product, Order, LiveStream) and backend logic including access control, user approval, blob storage, and CRUD operations for a marketplace platform. Integrates authorization and approval mixins with state maps for users, products, orders, and live streams.",
  "feature_evidence.json": "Feature evidence report confirming that all frontend query hooks in useQueries.ts are wired to the live backend canister actor with no mock data, mapped to test requirement REQ-4.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of all frontend source files, describing component purposes, bug fixes, and prop/API changes made across the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "HTML entry point for the RareRoots app that mounts the React root div, loads the Razorpay checkout script, and references the main TypeScript module.",
  "frontend/src/App.tsx": "Root React application file that sets up TanStack Router with all page routes, wraps the app in QueryClientProvider and ThemeProvider, and renders a global ProfileSetupModal and Toaster.",
  "frontend/src/components/BadgePill.tsx": "Small reusable badge/pill component that renders styled inline labels with configurable color variants (gold, green, indigo, red) and sizes (sm, md).",
  "frontend/src/components/FeaturedProducers.tsx": "Horizontally scrollable section displaying up to 8 featured rarity-badged, in-stock products from verified producers, with skeleton loading states and low-stock indicators.",
  "frontend/src/components/HeroSection.tsx": "Hero banner component with a background image, gradient overlay, headline text, and two CTA buttons navigating to the products listing and live sessions pages.",
  "frontend/src/components/Layout.tsx": "Defines the main app shell with a fixed top header (logo, orders, profile icons) and a fixed bottom navigation bar with four nav items (Home, Discover, Orders, Profile), highlighting the active route.",
  "frontend/src/components/LiveBadge.tsx": "Renders a small red 'LIVE' badge with an animated white dot, supporting 'sm' and 'md' size variants.",
  "frontend/src/components/LiveNowSection.tsx": "Displays a horizontal section of currently active live streams (up to 3), with skeleton loading states, fetched via useGetAllLiveStreams, and a 'View all' link to the live-sessions page.",
  "frontend/src/components/LiveSessionCard.tsx": "Renders a card for a single live stream showing the producer's avatar, stream title, status badge (live/scheduled/ended), region, start time, and optional story snippet.",
  "frontend/src/components/LiveSessionForm.tsx": "Provides a producer-facing form to schedule new live sessions and manage existing ones, including status changes and story updates, with toast notifications for feedback.",
  "frontend/src/components/LiveVideoModal.tsx": "Shows a modal dialog that auto-plays a live snap video and automatically closes after 15 seconds, using a ref-based timer.",
  "frontend/src/components/ProducerOrderList.tsx": "Displays orders grouped by product for a producer, allowing selection of a product via dropdown and inline order status updates with toast feedback.",
  "frontend/src/components/ProducerProfileForm.tsx": "Form for creating or updating a producer's profile (name, region, bio, photo), handling file upload with progress tracking and saving via useCreateOrUpdateProducer mutation.",
  "frontend/src/components/ProductCard.tsx": "Renders a clickable product card with thumbnail, rarity badge, out-of-stock overlay, low-stock badge, title, and price, navigating to the product detail page on click.",
  "frontend/src/components/ProductForm.tsx": "A form component for creating or editing a product, handling fields like title, price, stock, region, rarity badge, thumbnail upload, and voice note, with submission via a mutation hook.",
  "frontend/src/components/ProductListManager.tsx": "Manages a list of artisan products with options to add, edit, or delete entries, toggling between a product list view and the ProductForm component.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name and create a profile, shown only when the user is logged in but has no existing profile.",
  "frontend/src/components/PurchaseButton.tsx": "A styled button component for initiating a purchase, displaying a loading spinner, optional price, and a customizable label.",
  "frontend/src/components/PurchaseModal.tsx": "A dialog modal for confirming a product purchase, allowing quantity selection and processing payment via Razorpay before creating an order in the backend.",
  "frontend/src/components/RegionFilter.tsx": "A horizontal scrollable filter bar that renders region pill buttons and highlights the currently selected region.",
  "frontend/src/components/SearchBar.tsx": "A simple search input component with a search icon, used for filtering artisan products by text query.",
  "frontend/src/components/VoiceNotePlayer.tsx": "An audio player component that plays a voice note blob, providing play/pause controls, a seek slider, and formatted time display.",
  "frontend/src/components/VoiceNoteRecorder.tsx": "A React component that lets users record, play back, upload, and save audio voice notes, converting the recorded blob to an ExternalBlob before passing it to the parent via an onSave callback.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing it when the user's identity changes and invalidating dependent queries accordingly.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, exposing login/logout functions and identity state via React context.",
  "frontend/src/hooks/useMediaRecorder.ts": "A custom hook that wraps the browser MediaRecorder API to handle audio recording state, blob/URL management, duration tracking, and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data (producers, products, orders, live streams, user profiles), wrapping actor calls with proper cache invalidation.",
  "frontend/src/hooks/useRazorpay.ts": "A custom hook that wraps the Razorpay payment SDK, exposing an openPayment function that opens the Razorpay checkout modal and returns a promise resolving to the payment response.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes along with custom utility classes for the app's design tokens (earth-brown, sand-gold, ivory-cream, etc.).",
  "frontend/src/main.tsx": "React app entry point that mounts the app with QueryClientProvider for React Query and InternetIdentityProvider for ICP authentication wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Admin page that lists all producers and allows an authenticated admin to approve or reject them, with access-denied and login-required guard states.",
  "frontend/src/pages/Home.tsx": "Home page that composes the hero section, search bar, region filter, live-now section, and featured producers using verified products and producers from query hooks.",
  "frontend/src/pages/LiveSessions.tsx": "Live Sessions page that fetches all live streams, allows filtering by status (all/active/scheduled/ended), and renders sorted session cards with a hero banner.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success state with order summary, producer details, and a WhatsApp link for tracking after a successful purchase.",
  "frontend/src/pages/OrderHistory.tsx": "Order history page showing a buyer's past orders with stats, status filter chips, and per-order cards; guards against unauthenticated access.",
  "frontend/src/pages/ProducerBrandSetup.tsx": "Page for producers to set up or update their brand identity, including brand name, tagline, color, logo upload, and a recordable voice story (up to 30 seconds).",
  "frontend/src/pages/ProducerDashboard.tsx": "Producer dashboard page with tabs for managing products, profile, orders, and live sessions, plus a brand setup CTA and logout functionality.",
  "frontend/src/pages/ProducerDiscovery.tsx": "Discovery page listing verified producers filtered by region and search query, showing only producers with in-stock products and supporting voice note playback.",
  "frontend/src/pages/ProducerProfile.tsx": "Public profile page for a single producer displaying their avatar, brand info, badges, voice story, and product listings, with follow/unfollow functionality.",
  "frontend/src/pages/ProductDetail.tsx": "Detail page for a single product showing its image, stock status, producer info, purchase modal, live video modal, and a WhatsApp customization link.",
  "frontend/src/pages/ProductListing.tsx": "Page displaying all verified in-stock products in a grid with search and region filter controls.",
  "frontend/src/pages/Splash.tsx": "Splash screen component that displays a branded background, logo, tagline, and spinner, then auto-navigates to '/home' after 2 seconds.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom design tokens (colors, fonts, border radii, shadows, animations) for the RareRoots frontend, including shadcn/ui CSS variable mappings and brand-specific colors.",
  "project_state.json": "Project state manifest tracking existing features, pending feature requests (backend/DB integration, Motoko endpoints, Razorpay order fields, blob storage), and known issues for the RareRoots app."
}