{
  "backend/main.mo": "Main Motoko actor defining the full backend for the RareRoots platform, including data types (Producer, Product, Order, LiveStream), state maps, and shared/query functions for user profiles, producers, products, orders, live streams, and follower management with access control.",
  "feature_evidence.json": "A feature evidence report mapping implemented feature IDs (design tokens, splash screen, home dashboard redesign, etc.) to their corresponding source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, describing the purpose and recent changes of hooks, components, and pages.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind directives and defines CSS custom properties for the design token color/spacing system in both light and dark themes.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'RareRoots' and mounting the app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Root React application file that configures TanStack Router with all application routes (splash, home, products, producers, dashboard, orders, live sessions), wraps the app in QueryClient and ThemeProvider, and handles the splash-screen redirect guard.",
  "frontend/src/components/BadgePill.tsx": "Reusable badge/pill component that renders a styled inline label with four color variants (gold, green, indigo, red) using inline styles and Poppins font.",
  "frontend/src/components/FeaturedProducers.tsx": "Horizontally scrollable featured products section that filters products with a rarity badge and stock, displays thumbnail images with low-stock overlays, and navigates to the product detail page on click.",
  "frontend/src/components/HeroSection.tsx": "Renders the homepage hero section with a background image, tagline, and two CTA buttons linking to products and live sessions pages.",
  "frontend/src/components/Layout.tsx": "Provides the main app shell with a fixed header (logo, user/cart icons) and a bottom navigation bar, wrapping page content with appropriate padding.",
  "frontend/src/components/LiveBadge.tsx": "Small presentational component that renders a pulsing 'LIVE' badge in two sizes using terracotta styling.",
  "frontend/src/components/LiveNowSection.tsx": "Displays a grid of currently active live streams with skeleton loading states, mapping producer data to each LiveSessionCard.",
  "frontend/src/components/LiveSessionCard.tsx": "Card component for a single live stream showing producer avatar, region, stream title/description, optional story excerpt, and status badge (Live/Upcoming/Ended).",
  "frontend/src/components/LiveSessionForm.tsx": "Form for producers to schedule new live sessions and manage existing ones, including status transitions (start/stop) and story updates via mutation hooks.",
  "frontend/src/components/ProducerOrderList.tsx": "Displays a filterable list of orders for a producer with status badges and controls to update each order's status via a select dropdown.",
  "frontend/src/components/ProducerProfileForm.tsx": "A form component for creating or updating a producer's profile, including name, region, bio, and profile photo upload with progress tracking, using a mutation hook to persist changes.",
  "frontend/src/components/ProductCard.tsx": "Displays a product thumbnail, title, price, rarity badge, and stock status (low/out-of-stock overlays) as a clickable card that navigates to the product detail page.",
  "frontend/src/components/ProductForm.tsx": "A form for creating or editing a product listing with fields for title, description, price, region, stock, thumbnail upload, voice note, and rarity badge/countdown, submitting via a mutation hook.",
  "frontend/src/components/ProductListManager.tsx": "Manages a producer's product list with inline create/edit forms and delete confirmation dialogs, displaying each product's thumbnail, title, price, and stock.",
  "frontend/src/components/ProfileSetupModal.tsx": "A modal dialog that prompts newly authenticated users to enter their name on first login, saving the profile via a mutation hook and blocking dismissal until submitted.",
  "frontend/src/components/PurchaseButton.tsx": "A styled buy button that shows a spinner during loading, displays the price in INR, and is disabled when out of stock or processing.",
  "frontend/src/components/PurchaseModal.tsx": "A purchase confirmation dialog allowing users to select quantity and payment method, showing an order summary with producer share breakdown, and creating an order on confirmation.",
  "frontend/src/components/RegionFilter.tsx": "A horizontally scrollable row of region filter chips (All, Himalayas, Northeast, etc.) that highlights the selected region and calls a callback on selection.",
  "frontend/src/components/SearchBar.tsx": "A styled text input component with a search icon for filtering Himalayan herbs and Kutch crafts, with focus/blur border highlight effects.",
  "frontend/src/components/VoiceNotePlayer.tsx": "An audio player component that fetches a URL from an ExternalBlob and renders play/pause controls, a seekable progress bar, and time display for voice stories.",
  "frontend/src/components/VoiceNoteRecorder.tsx": "A voice note recorder component supporting microphone recording and file upload, with preview playback, upload progress tracking, and save/clear actions via ExternalBlob.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that creates and caches an authenticated or anonymous backend actor, initializing access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useMediaRecorder.ts": "A custom hook wrapping the browser MediaRecorder API to handle audio recording state, blob/URL creation, duration tracking, and cleanup.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data operations including user profiles, producers, products, orders, and live streams, using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts (Poppins, Roboto, Playfair Display), sets up Tailwind directives, defines CSS custom properties for light/dark themes using oklch colors, and declares utility classes for brand-specific colors and a primary button style.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Home.tsx": "Home page component displaying a hero banner, search bar, region filter, featured producers section, and a live-now teaser, with products filtered by search text and region from backend queries.",
  "frontend/src/pages/LiveSessions.tsx": "Live Sessions page that fetches all live streams and producers, allows filtering by status (all/active/scheduled/ended), and renders sorted session cards with a loading skeleton state.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays a success icon, order summary (product image, price, producer name), and a WhatsApp deep-link button for the buyer to contact the producer after placing an order.",
  "frontend/src/pages/OrderHistory.tsx": "Order history page showing a buyer's past orders with status filtering, summary stats (total orders, following count, delivered count), and per-order cards with product and producer details; redirects unauthenticated users to login.",
  "frontend/src/pages/ProducerBrandSetup.tsx": "A form page that allows producers to set up or update their brand identity, including brand name, tagline, color, logo upload, and a voice story recording (up to 30 seconds).",
  "frontend/src/pages/ProducerDashboard.tsx": "The producer's main dashboard page with tabs for managing products, profile, orders, and live sessions, plus a brand setup CTA and logout functionality.",
  "frontend/src/pages/ProducerDiscovery.tsx": "A discovery page listing all producers in a 2-column grid with region-based filter chips, skeleton loading states, and navigation to individual producer profiles.",
  "frontend/src/pages/ProducerProfile.tsx": "A public profile page for a single producer showing their photo, brand info, voice note, follower count, follow/unfollow toggle, and a grid of their products.",
  "frontend/src/pages/ProductDetail.tsx": "A detail page for a single product displaying its image, title, stock status, producer info, voice note, and a purchase modal trigger with WhatsApp custom order link.",
  "frontend/src/pages/ProductListing.tsx": "A paginated product listing page with search bar and region filter, rendering all products in a 2-column grid with skeleton loading and empty states.",
  "frontend/src/pages/Splash.tsx": "Splash screen component that displays the app logo, tagline, and a loading spinner for 2 seconds before navigating to the home route. Uses an ivory-to-gold gradient background with Poppins/Playfair Display typography.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes. Supports sessionStorage fallback for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with the app's design system tokens: custom colors (earth-brown, sand-gold, ivory-cream, etc.), font families (Poppins, Roboto, Playfair Display), border radii, shadows, and animations.",
  "project_state.json": "Project state snapshot (version 7) describing the SamriddhiSrot marketplace app's design system, 8 screens, architectural notes, payment integration, and existing implemented features. Serves as a reference document for build planning and feature tracking."
}