{
  "kind": "build_request",
  "title": "Add backend and database integration",
  "projectName": "RareRoots",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Motoko backend actor in backend/main.mo defines and persists all core data types — Producer, Product, Order, LiveStream, and User Profile — using stable variables so state survives canister upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "add bacj=kend",
          "where is the backend ans database intregation"
        ]
      },
      "acceptanceCriteria": [
        "All four core data types (Producer, Product, Order, LiveStream) are declared as stable variables in main.mo.",
        "Data persists across canister upgrades without loss.",
        "All CRUD endpoints for producers, products, orders, and live streams are implemented and callable."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement all public backend endpoints required by the frontend query hooks in frontend/src/hooks/useQueries.ts, including: user profile create/get/update, producer register/get/list/approve/reject, product create/get/list/update/delete, order place/get/list/update-status, live stream create/get/list/update, and follower add/remove/list.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "where is the backend ans database intregation"
        ]
      },
      "acceptanceCriteria": [
        "All functions referenced in useQueries.ts are implemented in the backend actor.",
        "Each endpoint returns the correct data type as expected by the frontend.",
        "Access control is enforced (e.g., only producers can manage their own products, only admin can approve/reject producers)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Integrate Razorpay payment data into the Order data type: ensure the `razorpayPaymentId` field is stored on order creation and is returned in order query responses, consistent with the migration in backend/migration.mo.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "where is the backend ans database intregation"
        ]
      },
      "acceptanceCriteria": [
        "Order creation endpoint accepts and persists a razorpayPaymentId.",
        "Order query endpoints return the razorpayPaymentId field.",
        "Existing orders without a razorpayPaymentId default to null without errors."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Wire all frontend query hooks in frontend/src/hooks/useQueries.ts to call the actual deployed backend canister actor via the useActor hook, replacing any mock or stub data with live canister calls.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "where is the backend ans database intregation"
        ]
      },
      "acceptanceCriteria": [
        "useQueries.ts uses the actor from useActor to call backend functions.",
        "No hardcoded mock data remains in query hooks.",
        "React Query cache invalidation works correctly after mutations (e.g., placing an order, updating product stock)."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Implement blob storage support in the backend for producer profile photos, product thumbnails, voice notes, and brand logos — storing blobs as stable byte arrays keyed by a generated ID and exposing upload/retrieve endpoints.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "where is the backend ans database intregation"
        ]
      },
      "acceptanceCriteria": [
        "Blob upload endpoint accepts Blob (byte array) and returns a unique blob ID.",
        "Blob retrieval endpoint returns the stored bytes for a given ID.",
        "Frontend upload flows (profile photo, product thumbnail, voice note) use these endpoints successfully."
      ]
    }
  ],
  "constraints": [
    "All backend logic must remain in a single Motoko actor in backend/main.mo.",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "Use stable variables for all persistent state to survive upgrades.",
    "Migration logic for existing Order records (adding razorpayPaymentId) must be handled via backend/migration.mo."
  ],
  "nonGoals": [
    "Changing the visual design or UI layout of any existing page.",
    "Integrating any external database (PostgreSQL, MySQL, etc.).",
    "Adding new product or user-facing features beyond what is already designed.",
    "Modifying the Razorpay frontend checkout flow in useRazorpay.ts."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}