{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wire frontend queries to live backend canister",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Wire all frontend query hooks in useQueries.ts to call the actual deployed backend canister actor, replacing mock data with live canister calls",
      "acceptanceCriteria": [
        "useQueries.ts uses the actor from useActor to call backend functions.",
        "No hardcoded mock data remains in query hooks.",
        "React Query cache invalidation works correctly after mutations (e.g., placing an order, updating product stock)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Replace all mock/stub query implementations with live actor.methodName() calls using the actor from useActor hook. Ensure all queries are enabled only when actor is available. Update mutation onSuccess callbacks to invalidate related query keys (e.g., invalidate 'products' and 'product' queries after createOrUpdateProduct mutation). Remove any hardcoded mock data arrays or objects. For blob fields (profilePhoto, thumbnail, voiceNote, brandLogoBlob, voiceStoryBlob), ensure ExternalBlob instances are passed directly to backend mutations and returned correctly from queries. Verify razorpayPaymentId is passed to createOrder mutation when provided."
        },
        {
          "path": "frontend/src/components/PurchaseModal.tsx",
          "operation": "modify",
          "description": "Ensure the createOrder mutation passes the razorpayPaymentId received from the Razorpay payment handler to the backend. Verify that the order creation flow correctly handles the payment ID and navigates to the order confirmation page with the returned order ID."
        },
        {
          "path": "frontend/src/components/ProductForm.tsx",
          "operation": "modify",
          "description": "Verify that thumbnail and voiceNote file uploads are converted to ExternalBlob instances before being passed to the createOrUpdateProduct mutation. Ensure the ExternalBlob.fromBytes method is used correctly and progress tracking via withUploadProgress is wired to UI state. Use the blob-storage component's ExternalBlob class as documented in the component usage instructions."
        },
        {
          "path": "frontend/src/components/ProducerProfileForm.tsx",
          "operation": "modify",
          "description": "Verify that profilePhoto upload is converted to ExternalBlob before being passed to the createOrUpdateProducer mutation. Ensure upload progress is tracked and displayed. Use the blob-storage component's ExternalBlob class as documented."
        },
        {
          "path": "frontend/src/pages/ProducerBrandSetup.tsx",
          "operation": "modify",
          "description": "Verify that brandLogoBlob and voiceStoryBlob uploads are converted to ExternalBlob instances before being passed to the createOrUpdateProducer mutation. Ensure the voice recorder saves audio as ExternalBlob and the logo uploader converts image files correctly. Use the blob-storage component's ExternalBlob class as documented."
        }
      ]
    }
  ]
}